In [1]:
import pandas as pd

In [2]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
# criar lista
list('321')

['3', '2', '1']

In [5]:
#criar index e columns pro dataframe
df=pd.DataFrame(data,list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [7]:
#re-organiza as linhas (o indice)
df.sort_index(inplace=True)
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [8]:
# re-organizar as colunas tanbéem
df.sort_index(inplace=True, axis=1)
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [9]:
# sort os values dos meus dados (e.g. do menor para o maior)
df.sort_values(by='X', inplace=True)

In [10]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [12]:
# fazer o mesmo mas para as colunas
df.sort_values(by='3', axis=1, inplace=True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [13]:
#fazer dois sorts
df.sort_values(by=['X', 'Y'], inplace=True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [16]:
df.sort_index(inplace=True)
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [17]:
df.sort_values(by=['X', 'Y'], inplace=True)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [19]:
# exercicios
dados = [[9, 6, 3], [8, 5, 2], [7, 4, 1]]
df=pd.DataFrame(dados,list('ZYX'), list('CBA'))
df

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [21]:
# usando o comando sort erroneamente
df.sort_index()
df.sort_index(axis = 1)
df

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [ ]:
# nada ocorre
#Para que o método sort_index() modifique o DataFrame,
#o argumento inplace deve ser modificado para True.

In [26]:
# exercicios
dados = [['Ary', 'M', 21], ['Cátia', 'F', 19], ['Carlos', 'M', 50],
         ['Beto', 'M', 29],['Bruna', 'F', 31],['Ana', 'F', 42]]
df=pd.DataFrame(dados,list('012345'), list('NSX'))
df

        N  S   X
0     Ary  M  21
1   Cátia  F  19
2  Carlos  M  50
3    Beto  M  29
4   Bruna  F  31
5     Ana  F  42

In [28]:
# sort by N e S
df_B = df.sort_values(by = ['S', 'N'])
df_B

        N  S   X
5     Ana  F  42
4   Bruna  F  31
1   Cátia  F  19
0     Ary  M  21
3    Beto  M  29
2  Carlos  M  50

In [39]:
# Mais maneiras com o mesmo exemplo
data2 = [['Ary','M',21],['Cátia','F',19],['Carlos','M',50],['Beto','M',29],['Bruna','F',31],['Ana','F',42]]
df_A = pd.DataFrame(data2,list('012345'),['Nome', 'Sexo','Idade'])
df_A

     Nome Sexo  Idade
0     Ary    M     21
1   Cátia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [44]:
df_B = df_A.sort_values(by = ['Sexo', 'Nome'])
df_B

     Nome Sexo  Idade
5     Ana    F     42
4   Bruna    F     31
1   Cátia    F     19
0     Ary    M     21
3    Beto    M     29
2  Carlos    M     50

In [45]:
# Temos aqui df_A alterado com os valores ordenados e df_B vazio
df_B = df_A.sort_values(by = ['Sexo', 'Nome'], inplace = True)

In [46]:
#Por causa do inplace = True as alterações de sort_values serão salvas em df_A e também não é retornado nenhum valor, 
#significando que df_B não está recebendo nenhum valor
df_B

In [48]:
df_B = df_A.sort_values(by = ['Sexo', 'Nome'])
df_B

     Nome Sexo  Idade
5     Ana    F     42
4   Bruna    F     31
1   Cátia    F     19
0     Ary    M     21
3    Beto    M     29
2  Carlos    M     50

In [29]:
# como fazer essa lista de outras formas
Lista = (['Ary', 'Carlos', 'Catia', 'Beto', 'Ana', 'Bruna'],
         ['M', 'M', 'F', 'M', 'F', 'F'],
         [21, 19, 50, 29, 31, 42])

In [30]:
df = pd.DataFrame(Lista).T
df.columns = ['Nome', 'Sexo', 'Idade']
df

     Nome Sexo Idade
0     Ary    M    21
1  Carlos    M    19
2   Catia    F    50
3    Beto    M    29
4     Ana    F    31
5   Bruna    F    42

In [31]:
# ou 
Nomes = ['Ary', 'Carlos', 'Catia', 'Beto', 'Ana', 'Bruna']
Sexo = ['M', 'M', 'F', 'M', 'F', 'F']
Idades = [21, 19, 50, 29, 31, 42]

In [34]:
#juntá-las em uma só
total = Nomes + Sexo + Idades 
total

['Ary',
 'Carlos',
 'Catia',
 'Beto',
 'Ana',
 'Bruna',
 'M',
 'M',
 'F',
 'M',
 'F',
 'F',
 21,
 19,
 50,
 29,
 31,
 42]

In [38]:
def convert(total): return tuple(total)
print(convert(total))

('Ary', 'Carlos', 'Catia', 'Beto', 'Ana', 'Bruna', 'M', 'M', 'F', 'M', 'F', 'F', 21, 19, 50, 29, 31, 42)

In [36]:
tuple(total)

('Ary',
 'Carlos',
 'Catia',
 'Beto',
 'Ana',
 'Bruna',
 'M',
 'M',
 'F',
 'M',
 'F',
 'F',
 21,
 19,
 50,
 29,
 31,
 42)

In [37]:
import itertools

dictionary = dict(itertools.zip_longest(*[iter(total)]*2, fillvalue=""))
dictionary

{'Ary': 'Carlos',
 'Catia': 'Beto',
 'Ana': 'Bruna',
 'M': 'M',
 'F': 'F',
 21: 19,
 50: 29,
 31: 42}

Veja outros exemplos :
https://www.w3schools.com/python/gloss_python_join_lists.asp

In [49]:
nomes = [
    {"Nome": "Ary", "Sexo": "M", "Idade": 21},
    {"Nome": "Catia", "Sexo": "F", "Idade": 19},
    {"Nome": "Carlos", "Sexo": "M", "Idade": 50},
    {"Nome": "Beto", "Sexo": "M", "Idade": 29},
    {"Nome": "Bruna", "Sexo": "F", "Idade": 31},
    {"Nome": "Ana", "Sexo": "F", "Idade": 42}
        ]
df = pd.DataFrame(data = nomes)
df

     Nome Sexo  Idade
0     Ary    M     21
1   Catia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [50]:
# Opção 1: definir a ordem na criação
df = pd.DataFrame(data = nomes, columns = ["Nome", "Sexo", "Idade"])
df

     Nome Sexo  Idade
0     Ary    M     21
1   Catia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [52]:
# Opção 2: reordenar um df já criado
df = pd.DataFrame(data = nomes)
df = df[["Nome", "Sexo", "Idade"]]
df

     Nome Sexo  Idade
0     Ary    M     21
1   Catia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [53]:
# Opção 3: reordenar um df já criado
df = pd.DataFrame(data = nomes)
df = df.reindex(columns=["Nome", "Sexo", "Idade"])
df

     Nome Sexo  Idade
0     Ary    M     21
1   Catia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42